renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_send_cbw
 Description     : Send CBW
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     side        : Drive Number
 Return value    : uint16_t                 : Error Code
 ******************************************************************************/
static uint16_t usb_hmsc_send_cbw (usb_utr_t *ptr, uint16_t side)
{
    usb_er_t err;
    uint16_t toggle;
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;
#endif /* (BSP_CFG_RTOS_USED) */
    uint16_t pipe;

    pipe = g_usb_hmsc_out_pipe[ptr->ip][side];
    /* Set CBW TAG usb_hmsc_CbwTagCount()*/
    g_usb_hmsc_csw_tag_no[ptr->ip][side]++;
    if ((uint16_t) 0 == g_usb_hmsc_csw_tag_no[ptr->ip][side])
    {
        g_usb_hmsc_csw_tag_no[ptr->ip][side] = (uint16_t) 1;
    }

    /* pipe number */
    usb_hmsc_trans_data[ptr->ip][side].keyword = pipe;

    /* Transfer data address */
    usb_hmsc_trans_data[ptr->ip][side].p_tranadr = (void*) &g_usb_hmsc_cbw[ptr->ip][side];

    /* Transfer data length */
    usb_hmsc_trans_data[ptr->ip][side].tranlen = (uint32_t) USB_MSC_CBWLENGTH;

    /* Call Back Function Info */
#if (BSP_CFG_RTOS_USED)
    usb_hmsc_trans_data[ptr->ip][side].complete = &usb_hmsc_trans_result;
#else /* (BSP_CFG_RTOS_USED) */
    usb_hmsc_trans_data[ptr->ip][side].complete = &usb_hmsc_check_result;
#endif /* (BSP_CFG_RTOS_USED) */

    /* Not control transfer */
    usb_hmsc_trans_data[ptr->ip][side].p_setup = 0;
    usb_hmsc_trans_data[ptr->ip][side].segment = USB_TRAN_END;

    usb_hmsc_trans_data[ptr->ip][side].ip = ptr->ip;
    usb_hmsc_trans_data[ptr->ip][side].ipp = ptr->ipp;

    usb_hstd_set_pipe_info(ptr->ip, pipe, &g_usb_hmsc_pipe_table[side][USB_PIPE_DIR_OUT]);
    usb_hstd_set_pipe_reg (ptr, pipe);

    if (USB_SQMON == (USB_SQMON & g_usb_hmsc_out_pipectr[ptr->ip][side]))
    {
        toggle = USB_DO_SET_SQTGL;
    }
    else
    {
        toggle = USB_DO_CLR_SQTGL;
    }

    usb_hstd_change_device_state(ptr, (usb_cb_t) &usb_hstd_dummy_function, toggle, pipe);
    err = usb_hstd_transfer_start(&usb_hmsc_trans_data[ptr->ip][side]);
    if (USB_OK != err)
    {
        USB_PRINTF1("### Mass Storage Device Class submit error(drive:%d) !\n", side);
        return USB_HMSC_SUBMIT_ERR;
    }

#if (BSP_CFG_RTOS_USED)
    hmsc_retval = usb_hmsc_trans_wait_tmo((uint16_t)3000);
    ptr->status = hmsc_retval; /* Record the result of the request */
    switch (hmsc_retval)
    {
        case USB_DATA_NONE: /* Send CBW */
            g_usb_hmsc_out_pipectr[ptr->ip][side] = hw_usb_read_pipectr(ptr, pipe);
            return USB_HMSC_OK;
        break;
        case USB_DATA_STALL: /* Stall */
            USB_PRINTF1("*** CBW Transfer STALL(drive:%d) !\n", side);

            /* Reset */
            usb_hmsc_mass_storage_reset(ptr, g_usb_hmsc_drvno_tbl[side].devadr, usb_hmsc_trans_result);

            /* Clear Stall for OUT pipe */
            usb_hmsc_clear_stall(ptr, g_usb_hmsc_out_pipe[ptr->ip][side], class_trans_result);
            g_usb_hmsc_out_pipectr[ptr->ip][side] = 0;

            /* Clear Stall for IN pipe */
            usb_hmsc_clear_stall(ptr, g_usb_hmsc_in_pipe[ptr->ip][side], class_trans_result);
            g_usb_hmsc_in_pipectr[ptr->ip][side] = 0;
        break;
        case USB_DATA_TMO: /* Timeout */
            USB_PRINTF1("### CBW Transfer timeout ERROR(drive:%d) !\n", side);
            usb_hstd_transfer_end(ptr, g_usb_hmsc_out_pipe[ptr->ip][side], hmsc_retval);
        break;
        case USB_DATA_ERR:
            USB_PRINTF1("### CBW Transfer ERROR(drive:%d) !\n", side);
        break;
        default:
            USB_PRINTF1("### CBW Transfer ERROR(drive:%d) !\n", side);
        break;
    }

    return USB_HMSC_CBW_ERR;
#endif /* (BSP_CFG_RTOS_USED) */

    return (err);
}
/******************************************************************************
 End of function usb_hmsc_send_cbw
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_send_cbw_check
 Description     : Check send CBW 
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     side        : Drive Number
                 : uint16_t     result      : Transfer Result
 Return value    : uint16_t                 : Error Code
 ******************************************************************************/
static uint16_t usb_hmsc_send_cbw_check (usb_utr_t *ptr, uint16_t side, uint16_t result)
{
    switch (result)
    {
        case USB_DATA_NONE : /* Send CBW */
            g_usb_hmsc_out_pipectr[ptr->ip][side] = usb_hmsc_trans_data[ptr->ip][side].pipectr;
            return USB_HMSC_OK;
        break;
        case USB_DATA_STALL : /* Stall */
            USB_PRINTF1("*** CBW Transfer STALL(drive:%d) !\n", side);

/*        return USB_DATA_STALL;*/
            return USB_HMSC_STALL;
        break;
        case USB_DATA_ERR :
            USB_PRINTF1("### CBW Transfer ERROR(drive:%d) !\n", side);
        break;
        default :
            USB_PRINTF2("### CBW Transfer error(drive:%d) result:%d !\n", side, result);
        break;
    }
    return USB_HMSC_CBW_ERR;
}
/******************************************************************************
 End of function usb_hmsc_send_cbw_check
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hmsc_get_data
 Description     : Receive Data request
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     side        : Drive Number
                 : uint8_t      *buff       : Pointer to the area to store the data
                 : uint32_t     size        : Receive Data Size
 Return value    : uint16_t                 : Error Code
 ******************************************************************************/
static uint16_t usb_hmsc_get_data (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size)
{
    usb_er_t err;
    uint16_t toggle;
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;
#endif /* (BSP_CFG_RTOS_USED) */
    uint16_t pipe;

    pipe = g_usb_hmsc_in_pipe[ptr->ip][side];
    /* pipe number */
    usb_hmsc_receive_data[ptr->ip][side].keyword = pipe;

    /* Transfer data address */
    usb_hmsc_receive_data[ptr->ip][side].p_tranadr = (void*) buff;

    /* Transfer data length */
    usb_hmsc_receive_data[ptr->ip][side].tranlen = size;

    /* Call Back Function Info */
#if (BSP_CFG_RTOS_USED)
    usb_hmsc_receive_data[ptr->ip][side].complete = &usb_hmsc_trans_result;
#else /* (BSP_CFG_RTOS_USED) */
    usb_hmsc_receive_data[ptr->ip][side].complete = &usb_hmsc_check_result;
#endif /* (BSP_CFG_RTOS_USED) */

