renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
    return err;
}
/******************************************************************************
 End of function usb_hmsc_send_data
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_send_data_check
 Description     : Check Send Data
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     side        : Drive Number
                 : uint16_t     result      : Transfer Result
 Return value    : uint16_t                  : Error Code
 ******************************************************************************/
static uint16_t usb_hmsc_send_data_check (usb_utr_t *ptr, uint16_t side, uint16_t result)
{
    switch (result)
    {
        case USB_DATA_NONE :
            g_usb_hmsc_out_pipectr[ptr->ip][side] = usb_hmsc_trans_data[ptr->ip][side].pipectr;
            return USB_HMSC_OK;
        break;
        case USB_DATA_STALL :
            USB_PRINTF1("*** SendData STALL(drive:%d) !\n", side);
            g_usb_hmsc_out_pipectr[ptr->ip][side] = 0;
            return USB_HMSC_STALL;
        break;
        case USB_DATA_ERR :
            USB_PRINTF1("### SendData ERROR(drive:%d) !\n", side);
        break;
        default :
            USB_PRINTF1("### SendData error(drive:%d) !\n", side);
        break;
    }
    return USB_HMSC_DAT_WR_ERR;
}
/******************************************************************************
 End of function usb_hmsc_send_data_check
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hmsc_get_csw
 Description     : Receive CSW
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     side        : Drive Number
 Return value    : uint16_t                  : Error Code
 ******************************************************************************/
static uint16_t usb_hmsc_get_csw (usb_utr_t *ptr, uint16_t side)
{   
    usb_er_t err;
    uint16_t toggle;
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;
    uint32_t    request_size;
#endif /* (BSP_CFG_RTOS_USED) */
    uint16_t pipe;

    pipe = g_usb_hmsc_in_pipe[ptr->ip][side];
    /* pipe number */
    usb_hmsc_receive_data[ptr->ip][side].keyword = pipe;

    /* Transfer data address */
    usb_hmsc_receive_data[ptr->ip][side].p_tranadr = (void*) &g_usb_hmsc_csw[ptr->ip][side];

    /* Transfer data length */
    usb_hmsc_receive_data[ptr->ip][side].tranlen = (uint32_t) USB_MSC_CSW_LENGTH;

    /* Call Back Function Info */
#if (BSP_CFG_RTOS_USED)
    usb_hmsc_receive_data[ptr->ip][side].complete = &usb_hmsc_trans_result;
#else /* (BSP_CFG_RTOS_USED) */
    usb_hmsc_receive_data[ptr->ip][side].complete = &usb_hmsc_check_result;
#endif /* (BSP_CFG_RTOS_USED) */
    usb_hmsc_receive_data[ptr->ip][side].p_setup = 0;

    /* Not control transfer */
    usb_hmsc_receive_data[ptr->ip][side].segment = USB_TRAN_END;
    usb_hmsc_receive_data[ptr->ip][side].ip = ptr->ip;
    usb_hmsc_receive_data[ptr->ip][side].ipp = ptr->ipp;

    usb_hstd_set_pipe_info(ptr->ip, pipe, &g_usb_hmsc_pipe_table[side][USB_PIPE_DIR_IN]);
    usb_hstd_set_pipe_reg (ptr, pipe);

    if (USB_SQMON == (USB_SQMON & g_usb_hmsc_in_pipectr[ptr->ip][side]))
    {
        toggle = USB_DO_SET_SQTGL;
    }
    else
    {
        toggle = USB_DO_CLR_SQTGL;
    }
    usb_hstd_change_device_state(ptr, (usb_cb_t) &usb_hstd_dummy_function, toggle,pipe);

    err = usb_hstd_transfer_start(&usb_hmsc_receive_data[ptr->ip][side]);
    if (USB_OK != err)
    {
        USB_PRINTF1("### Mass Storage Device Class submit error(drive:%d) !\n", side);
        return USB_HMSC_SUBMIT_ERR;
    }

#if (BSP_CFG_RTOS_USED)
    hmsc_retval = usb_hmsc_trans_wait_tmo((uint16_t)3000);
    ptr->status = hmsc_retval; /* Record the result of the request */
    switch (hmsc_retval)
    {
        case USB_DATA_SHT: /* Continue */
        case USB_DATA_OK:
            g_usb_hmsc_in_pipectr[ptr->ip][side] = hw_usb_read_pipectr(ptr, pipe);

            request_size = g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_lo;
            request_size |= (g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_ml << 8);
            request_size |= (g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_mh << 16);
            request_size |= (g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_hi << 24);
            ptr->tranlen = request_size - g_usb_hmsc_cmd_data_length[ptr->ip];

            /* CSW Check */
            if (USB_MSC_CSW_SIGNATURE != g_usb_hmsc_csw[ptr->ip][side].dcsw_signature)
            {
                USB_PRINTF2("### CSW signature error 0x%08x:SIGN=0x%08x.\n",
                        g_usb_hmsc_csw[ptr->ip][side].dcsw_signature, USB_MSC_CSW_SIGNATURE);
                return USB_HMSC_CSW_ERR;
            }
            if (g_usb_hmsc_csw[ptr->ip][side].dcsw_tag != g_usb_hmsc_cbw[ptr->ip][side].dcbw_tag)
            {
                USB_PRINTF2("### CSW Tag error 0x%08x:CBWTAG=0x%08x.\n",
                        g_usb_hmsc_csw[ptr->ip][side].dcsw_tag, g_usb_hmsc_cbw[ptr->ip][side].dcbw_tag);
                return USB_HMSC_CSW_ERR;
            }
            switch (g_usb_hmsc_csw[ptr->ip][side].dcsw_status)
            {
                case USB_MSC_CSW_OK:
                    return USB_HMSC_OK;
                break;
                case USB_MSC_CSW_NG:
                    return  USB_HMSC_CSW_ERR;
                break;
                case USB_MSC_CSW_PHASE_ERR:
                    if (USB_ON == usb_hmsc_csw_err_stall[ptr->ip])
                    {
                        usb_hmsc_csw_err_stall[ptr->ip] = USB_OFF;

                        /* Reset */
                        usb_hmsc_mass_storage_reset(ptr, g_usb_hmsc_drvno_tbl[side].devadr, usb_hmsc_trans_result);

                        /* Clear STALL for OUT pipe */
                        usb_hmsc_clear_stall(ptr, g_usb_hmsc_out_pipe[ptr->ip][side], class_trans_result);
                        g_usb_hmsc_out_pipectr[ptr->ip][side] = 0;

