renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_configured
 Description     : Callback function for MSC device configured
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     devadr  : Device Address
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_configured (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    uint16_t ret;
    uint16_t side;

    ret = usb_hmsc_strg_drive_open(ptr, devadr, &side);
    if (USB_ERROR == ret)
    {
        USB_PRINTF1("### usb_hmsc_strg_drive_open error (%x)\n", ret);
        usb_hstd_connect_err_event_set(ptr->ip);
    }
    
#if (BSP_CFG_RTOS_USED == 1)
    xSemaphoreTake(SemaphoreHandleRead, portMAX_DELAY);
    usb_hmsc_strg_drive_search(ptr, devadr, (usb_cb_t)usb_hmsc_drive_complete);
    xSemaphoreGive(SemaphoreHandleRead);
#endif  /* BSP_CFG_RTOS_USED == 1 */
    
}
/******************************************************************************
 End of function usb_hmsc_configured
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_detach
 Description     : Callback function for MSC device detach
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     addr    : Device Address
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_detach (usb_utr_t *ptr, uint16_t addr, uint16_t data2)
{
#if (BSP_CFG_RTOS_USED == 0)
    uint16_t i;
    uint16_t j;
    uint16_t side;
    uint16_t que_cnt;
    usb_ctrl_t ctrl;
    uint16_t ipno_devaddr;

    /* Clear pipe table. */
    usb_hstd_clr_pipe_table (ptr->ip, addr);

    ipno_devaddr = addr;
    if ( USB_IP1 == ptr->ip)
    {
        ipno_devaddr |= USBA_ADDRESS_OFFSET;
    }

    if (g_drive_search_lock == ipno_devaddr)
    {
        g_drive_search_lock = USB_FALSE;
    }

    que_cnt = g_drive_search_que_cnt;
    /* WAIT_LOOP */
    for (i = 0; i < que_cnt; i++)
    {
        if (g_drive_search_que[i] == ipno_devaddr)
        {
            g_drive_search_que[i] = USB_FALSE;
            /* WAIT_LOOP */
            for (j = i; j < que_cnt; j++)
            {
                g_drive_search_que[j] = g_drive_search_que[j + 1];
            }
            g_drive_search_que_cnt--;
        }
    }

    side = usb_hmsc_ref_drvno(ipno_devaddr);
    if (USB_ERROR != side)
    {
        usb_hmsc_strg_drive_close(ptr, side); /* Callback when device is detached. */
    }

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = addr;
    usb_set_event(USB_STS_DETACH, &ctrl); /* Set Event()  */

#else   /* BSP_CFG_RTOS_USED == 0 */
    usb_ctrl_t  ctrl;
    uint16_t    side;
    uint16_t    ipno_devaddr;

    ipno_devaddr = addr;
    if (USB_IP1 == ptr->ip)
    {
        ipno_devaddr |= USBA_ADDRESS_OFFSET;
    }
    
    side = usb_hmsc_ref_drvno(ipno_devaddr);
    if (USB_ERROR != side)
    {
        usb_hmsc_strg_drive_close(ptr, side); /* Callback when device is detached. */
    }

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = addr;
    usb_set_event(USB_STS_DETACH, &ctrl); /* Set Event()  */
#endif  /* BSP_CFG_RTOS_USED == 0 */
}
/******************************************************************************
 End of function usb_hmsc_detach
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hmsc_drive_complete
 Description     : Next Process Selector
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     addr    : Device Address
                 : uint16_t     data2   : Not used
 Return          : none
 ******************************************************************************/
void usb_hmsc_drive_complete (usb_utr_t *ptr, uint16_t addr, uint16_t data2)
{
    usb_ctrl_t  ctrl;
#if (BSP_CFG_RTOS_USED == 0)
    uint16_t    que_cnt;
    uint16_t    i;

    que_cnt = g_drive_search_que_cnt;
    if (g_drive_search_que_cnt)
    {
        g_drive_search_que[0] = USB_NULL;
        /* WAIT_LOOP */
        for (i = 0; i < que_cnt; i++)
        {
            g_drive_search_que[i] = g_drive_search_que[i + 1];
        }
        g_drive_search_que_cnt--;
    }
    g_drive_search_lock = USB_FALSE;
#endif  /* BSP_CFG_RTOS_USED == 0 */

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = addr;

    usb_set_event(USB_STS_CONFIGURED, &ctrl); /* Set Event()  */
} /* End of function usb_hmsc_drive_complete() */

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_registration
 Description     : sample registration.
 Argument        : none
 Return          : none
 ******************************************************************************/
void usb_registration (usb_utr_t *ptr)
{
    usb_hmsc_registration(ptr);
} /* End of function usb_registration() */
#endif  /* BSP_CFG_RTOS_USED == 0 */

/******************************************************************************
 Function Name   : usb_hmsc_classinit
 Description     : Host msc driver init
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t data1    : Not used.
                 : uint16_t data2    : Not used.
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_classinit (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    uint16_t side;

#if (BSP_CFG_RTOS_USED)
    usb_hmsc_csw_err_stall[ptr->ip] = USB_OFF;
#endif /* BSP_CFG_RTOS_USED */

    for (side =0; side <USB_MAXSTRAGE; side++)
    {
        usb_hmsc_strg_drive_close (ptr, side);
    }
}
/******************************************************************************
 End of function usb_hmsc_classinit
 ******************************************************************************/

