renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_registration
 Description     : registration of Host msc driver.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void usb_hmsc_registration (usb_utr_t *ptr)
{
    usb_hcdreg_t driver;
#if USB_CFG_HUB == USB_CFG_ENABLE
    uint8_t i;
#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */

    /* Driver registration */
    driver.ifclass    = (uint16_t) USB_IFCLS_MAS;           /* Use Interface class for MSC. */
    driver.p_tpl      = (uint16_t*) &g_usb_hmsc_devicetpl;  /* Target peripheral list. */
    driver.classinit  = &usb_hmsc_classinit;                /* Driver init. */
    driver.classcheck = &usb_hmsc_class_check;              /* Driver check. */
    driver.devconfig  = &usb_hmsc_configured;               /* Callback when device is configured. */
    driver.devdetach  = &usb_hmsc_detach;                   /* Callback when device is detached. */
    driver.devsuspend = &usb_hstd_dummy_function;           /* Callback when device is suspended. */
    driver.devresume  = &usb_hstd_dummy_function;           /* Callback when device is resumed. */

#if USB_CFG_HUB == USB_CFG_ENABLE
    /* WAIT_LOOP */
    for (i = 0; i < USB_MAXSTRAGE; i++) /* Loop support HID device count */
    {
        usb_hstd_driver_registration(ptr, &driver); /* Host MSC class driver registration. */
    }
#if (BSP_CFG_RTOS_USED == 0)
    usb_cstd_set_task_pri(USB_HUB_TSK, USB_PRI_3); /* Hub Task Priority set */
#endif  /* BSP_CFG_RTOS_USED == 0 */

    usb_hhub_registration(ptr, (usb_hcdreg_t *) USB_NULL); /* Hub registration. */
#else   /* USB_CFG_HUB == USB_CFG_ENABLE */
    usb_hstd_driver_registration(ptr, &driver); /* Host MSC class driver registration. */
#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */
}
/******************************************************************************
 End of function usb_hmsc_registration
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_message_retry
 Description     : Message transfer retry for Que Over
 Arguments       : uint16_t     id      : Message ID
                 : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
 usb_utr_t *mess
 Return value    : none
 ******************************************************************************/
void usb_hmsc_message_retry (uint16_t id, usb_utr_t *mess)
{
    usb_er_t err;
    usb_utr_t *pblf;

    /* Resend message */
    if ( USB_HSTRG_MBX == id)
    {
        err = USB_PGET_BLK(USB_HSTRG_MPL, &pblf);
    }
    if (USB_OK == err)
    {
        pblf->msginfo = mess->msginfo;
        pblf->keyword = mess->keyword;
        pblf->result = mess->result;
        pblf->complete = mess->complete;
        pblf->ip = mess->ip;
        pblf->ipp = mess->ipp;

        /* Send message */
        err = USB_SND_MSG(id, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            USB_PRINTF1("### snd_msg error (%ld)\n", err);
            err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )pblf);
            if (USB_OK != err)
            {
                USB_PRINTF1("### rel_blk error (%ld)\n", err);
            }
        }
    }
    else
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }

}
/******************************************************************************
 End of function usb_hmsc_message_retry
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hmsc_smp_drive2_addr
 Description     : Retrieves device address
 Arguments       : uint16_t     side    : Drive number
                 : usb_utr_t    *devadr : Pointer to usb_utr_t structure
 Return value    : uint16_t             : Device address
 ******************************************************************************/
void usb_hmsc_smp_drive2_addr (uint16_t side, usb_utr_t *devadr)
{
    devadr->keyword = g_usb_hmsc_drvno_tbl[side].devadr; /* Device Address */
    devadr->ip = g_usb_hmsc_drvno_tbl[side].ip; /* USB IP No.     */
    devadr->ipp = usb_hstd_get_usb_ip_adr(devadr->ip);
}
/******************************************************************************
 End of function usb_hmsc_smp_drive2_addr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_cmd_complete
 Description     : Serial state receive complete call-back.
 Argument        : usb_utr_t    *mess   : Pointer to usb_utr_t structure
                 : uint16_t     devadr  : Device address
                 : uint16_t     data2   : Not used
 Return          : none
 ******************************************************************************/
void usb_hmsc_strg_cmd_complete (usb_utr_t *mess, uint16_t devadr, uint16_t data2)
{
#if (BSP_CFG_RTOS_USED == 0)
    usb_ctrl_t ctrl;

    ctrl.module = mess->ip; /* Module number setting */
    ctrl.pipe = mess->keyword; /* Pipe number setting */
    ctrl.address = usb_hstd_get_devsel(mess, ctrl.pipe) >> 12;
    ctrl.size = 0;

    switch (mess->result)
    {
        case USB_HMSC_OK:
            ctrl.size = mess->tranlen;
            ctrl.status = USB_CSW_SUCCESS;
        break;

        case USB_HMSC_CSW_ERR:
            ctrl.status = USB_CSW_FAIL;
        break;

        case USB_HMSC_CSW_PHASE_ERR:
            ctrl.status = USB_CSW_PHASE;
        break;

        default:
            ctrl.status = USB_CSW_FAIL;
        break;
    }
#if (BSP_CFG_RTOS_USED == 1)
    ctrl.p_data = (void *)mess->cur_task_hdl;
#endif /* (BSP_CFG_RTOS_USED == 1) */

