renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
    usb_set_event(USB_STS_MSC_CMD_COMPLETE, &ctrl); /* Set Event(USB receive complete)  */
#endif  /* BSP_CFG_RTOS_USED == 0 */
} /* End of function usb_hmsc_strg_cmd_complete() */

#if (BSP_CFG_RTOS_USED)
/******************************************************************************
 Function Name   : usb_hmsc_get_string_info
 Description     : Get string descriptors.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t addr
                   uint16_t string
 Return value    : none
 ******************************************************************************/
uint16_t usb_hmsc_get_string_info(usb_utr_t *mess, uint16_t addr, uint16_t string)
{
    uint16_t retval;

    /* Send GetDescriptor(String) */
    retval = usb_hmsc_get_string_desc(mess, addr, (uint16_t)0, usb_hmsc_req_trans_result);
    if (USB_OK != retval)
    {
        return USB_ERROR;
    }

    /* Send GetDescriptor(String) */
    retval = usb_hmsc_get_string_desc(mess, addr, (uint16_t)string, usb_hmsc_req_trans_result);
    if (USB_OK != retval)
    {
        return USB_ERROR;
    }

    return USB_OK;
} /* End of function usb_hmsc_get_string_info() */

/******************************************************************************
 Function Name   : usb_hmsc_req_trans_result
 Description     : Send a message to notify the result of the hmsc class request (PIPE0).
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t data1
                   uint16_t data2
 Return value    : none
 ******************************************************************************/
void usb_hmsc_req_trans_result(usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_er_t err;

#if BSP_CFG_RTOS_USED == 1
    gs_usb_hmsc_req_tran_result_msg = *mess;

    /* Send a message to HMSC mailbox */
    err = USB_SND_MSG(USB_HMSC_REQ_MBX, (usb_msg_t *)&gs_usb_hmsc_req_tran_result_msg);
#else  /* BSP_CFG_RTOS_USED == 1 */
    err = USB_SND_MSG(USB_HMSC_REQ_MBX, (usb_msg_t *)mess);
#endif /* BSP_CFG_RTOS_USED == 1 */
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC snd_msg error (%ld)\n", err);
    }
} /* End of function usb_hmsc_req_trans_result() */

/******************************************************************************
 Function Name   : usb_hmsc_req_trans_wait_tmo
 Description     : Receive the result of the hmsc class request with a timeout (PIPE0).
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t tmo     : Time-out value.
 Return value    : USB_OK/USB_ERROR
 ******************************************************************************/
uint16_t usb_hmsc_req_trans_wait_tmo(uint16_t tmo)
{
    usb_utr_t *mess;
    usb_er_t err;

    /* Receive message from HMSC_REQ mailbox with time-out */
    err = USB_TRCV_MSG(USB_HMSC_REQ_MBX, (usb_msg_t **)&mess, (usb_tm_t)tmo);
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC trcv_msg error (%ld)\n", err);
        return USB_ERROR;
    }

    return (mess->status);
} /* End of function usb_hmsc_req_trans_wait_tmo() */

/******************************************************************************
 Function Name   : usb_hmsc_trans_result
 Description     : Send a message to notify the result of the hmsc class request.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t data1
                   uint16_t data2
 Return value    : none
 ******************************************************************************/
void usb_hmsc_trans_result(usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_er_t err;

#if BSP_CFG_RTOS_USED == 1
    gs_usb_hmsc_tran_result_msg = *mess;

    /* Send a message to HMSC mailbox */
    err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t *)&gs_usb_hmsc_tran_result_msg);
#else  /* BSP_CFG_RTOS_USED == 1 */
    err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t *)mess);
#endif /* BSP_CFG_RTOS_USED == 1 */
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC snd_msg error (%ld)\n", err);
    }
} /* End of function usb_hmsc_trans_result() */

/******************************************************************************
 Function Name   : usb_hmsc_trans_wait_tmo
 Description     : Receive the result of the hmsc class request with a timeout.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t tmo     : Time-out value.
 Return value    : USB_OK/USB_ERROR
 ******************************************************************************/
uint16_t usb_hmsc_trans_wait_tmo(uint16_t tmo)
{
    usb_utr_t *mess;
    usb_er_t err;

    /* Receive message from HMSC mailbox with time-out */
    err = USB_TRCV_MSG(USB_HMSC_MBX, (usb_msg_t **)&mess, (usb_tm_t)tmo);
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC trcv_msg error (%ld)\n", err);
        return USB_ERROR;
    }

    return (mess->status);
} /* End of function usb_hmsc_trans_wait_tmo() */

#endif /* (BSP_CFG_RTOS_USED) */

/******************************************************************************
 Function Name   : usb_hmsc_driver_start
 Description     : USB Host Initialize process
 Argument        : none
 Return          : none
 ******************************************************************************/
void usb_hmsc_driver_start (uint16_t ip_no)
{
    uint16_t i;
    static uint16_t init_flag = 0;

    /* WAIT_LOOP */
    for (i = 0; i < USB_MAXSTRAGE; i++)
    {
        if (0 == init_flag)
        {       
            g_usb_hmsc_drvno_tbl[i].use_flag = USB_NOUSE;
        }
        else
        {
            if (USB_TRUE == g_usb_hmsc_drvno_tbl[i].use_flag)
            {
                if (ip_no == g_usb_hmsc_drvno_tbl[i].ip)
                {
                    g_usb_hmsc_drvno_tbl[i].use_flag = USB_NOUSE;
                }
            }
        }

        g_usb_hmsc_in_pipe[ip_no][i] = USB_NOPORT;  /* Pipenumber */
        g_usb_hmsc_out_pipe[ip_no][i] = USB_NOPORT; /* Pipenumber */

