renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_free_drvno
 Description     : Release Drive no.
 Arugments       : uint16_t     side    : Drive number
 Return value    : result
 ******************************************************************************/
uint16_t usb_hmsc_free_drvno (uint16_t side)
{
    if (side > USB_MAXSTRAGE)
    {
        return USB_ERROR;
    }

    g_usb_hmsc_drvno_tbl[side].use_flag = USB_NOUSE;
    g_usb_hmsc_drvno_tbl[side].ip = USB_NOUSE;
    g_usb_hmsc_drvno_tbl[side].devadr = USB_NOUSE;
    return USB_OK;
}
/******************************************************************************
 End of function usb_hmsc_free_drvno
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_ref_drvno
 Description     : Get Drive no.
 Arguments       : uint16_t devadr       : Device address
 Return value    : Drive no.
 ******************************************************************************/
uint16_t usb_hmsc_ref_drvno (uint16_t devadr)
{
    uint16_t side;
    uint16_t ipno;

    if (USBA_ADDRESS_OFFSET == (devadr & USB_IP_MASK))
    {
        ipno = USB_IP1;
    }
    else
    {
        ipno = USB_IP0;
    }
    devadr &= USB_ADDRESS_MASK;

    /* WAIT_LOOP */
    for (side = 0; side < USB_MAXSTRAGE; side++)
    {
        if ((devadr == g_usb_hmsc_drvno_tbl[side].devadr) && (ipno == g_usb_hmsc_drvno_tbl[side].ip))
        {
            return side;
        }
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hmsc_ref_drvno
 ******************************************************************************/

#if USB_CFG_HUB != USB_CFG_ENABLE
/******************************************************************************
 Function Name   : usb_hhub_task
 Description     : HUB task
 Arguments       : usb_vp_int_t stacd          : Start Code of Hub Task
 Return value    : none
 ******************************************************************************/
void usb_hhub_task (usb_vp_int_t stacd)
{
    /* None */
}
/******************************************************************************
 End of function usb_hhub_task
 ******************************************************************************/
#endif  /* USB_CFG_HUB != USB_CFG_ENABLE */

#endif /* defined(USB_CFG_HMSC_USE) */


/******************************************************************************
 End  Of File
 ******************************************************************************/
